config_doom.org
#+TITLE: Config
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle ~/.dotfiles/.config/doom/config.el

* Tips
#+begin_src emacs-lisp
;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `after!' block, otherwise Doom's defaults may override your settings. E.g.
;;
;;   (after! PACKAGE
;;     (setq x y))
;;
;; The exceptions to this rule:
;;
;;   - Setting file/directory variables (like `org-directory')
;;   - Setting variables which explicitly tell you to set them before their
;;     package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;   - Setting doom variables (which start with 'doom-' or '+').
;;
;; Here are some additional functions/macros that will help you configure Doom.
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src
* System specific
#+begin_src emacs-lisp
(if (string= system-type "darwin")
 (setq mac-option-modifier 'super)
 (setq mac-command-modifier 'meta))
#+end_src
* Dashboard
** Private configuration directory
#+begin_src emacs-lisp
(setq doom-private-dir "/home/kaypro/.dotfiles/")
#+end_src

* Appearance
** Frame
- need to check out how to Toggle Fullscreen when starting client
#+begin_src emacs-lisp
;; (add-hook 'window-setup-hook #'toggle-frame-fullscreen)
(setq default-frame-alist '((undecorated . t))) ; get rid of title bar
#+end_src
** Themes
- choosing theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-dracula)
#+end_src
- enabling bold and italic for the theme but may not be necessary
#+begin_src emacs-lisp :tangle no
;; (after! doom-themes
;;   (setq doom-themes-enable-bold t
;;         doom-themes-enable-italic t))
#+end_src
** Font
*** Install Fonts
#+begin_src emacs-lisp
;; (all-the-icons-install-fonts t)
;; (nerd-icons-install-fonts)
#+end_src
*** Choose Font
#+begin_src emacs-lisp
(if (string= (system-name) "kaypro-MacBookPro")
    (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 19)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 27)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font" :size 40)))

(if (string= (system-name) "Kays-Mac-mini.local")
    (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15)
      doom-variable-pitch-font (font-spec :family "JetBrainsMono Nerd Font" :size 15)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font" :size 40)))

(if (string= (system-name) "kaypro-UX330UAK")
    (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 20)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 20)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font" :size 24)))
#+end_src
** Faces
*** Comments
- Having comments italic
#+begin_src emacs-lisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic)
  )
#+end_src
*** Parenthesis
- Highlight matching paranthesis italic
#+begin_src emacs-lisp
(custom-set-faces!
  '(show-paren-match :weight ultrabold :slant italic :foreground "red" :background "gray7")
  )
#+end_src
** Lines
#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type 'relative)
(setq global-visual-line-mode t)
#+end_src
** Opacity
#+begin_src emacs-lisp
;; (set-frame-parameter (selected-frame) 'alpha '(92 92))
;; (add-to-list 'default-frame-alist '(alpha . 92))
#+end_src
** Modeline
#+begin_src emacs-lisp
(setq doom-modeline-buffer-file-name-style 'truncate-upto-project)
#+end_src
* Org
** Org-Directories
#+begin_src emacs-lisp
(after! org
  ;; If you use `org' and don't want your org files in the default location below,
  ;; change `org-directory'. It must be set before org loads!
  (setq org-directory "~/org/")
  (setq org-attach-directory "~/org-files/.attach"))
#+end_src
** Org-Agenda
*** Agenda files
#+begin_src emacs-lisp
(setq org-agenda-files
      '("~/org/Habits.org" "~/org/todo.org"))
#+end_src
*** Tags
#+begin_src emacs-lisp
(setq org-tag-alist
      '((:startgroup)
                                        ; Put mutually exclusive tags here
        (:endgroup)
        ("work" . ?w)
        ("email" . ?e)
        ("config" . ?c)
        ("private" . ?p)
        ("idea" . ?i)))
#+end_src
*** Refile Targets
#+begin_src emacs-lisp
(setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)
        ("todo.org" :maxlevel . 2)))
;; Save Org buffers after refiling!
(advice-add 'org-refile :after #'(lambda (&rest _) (org-save-all-org-buffers)))
;; (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src
*** Layout
#+begin_src emacs-lisp
;; (setq org-agenda-start-with-log-mode t)
(setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))
          (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

        ("n" "Next Tasks"
         ((todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))))))
#+end_src

#+begin_src emacs-lisp
(after! org
  (add-to-list 'org-modules 'org-habit)
  (setq org-agenda-show-future-repeats nil))
#+end_src
** Org-capture
#+begin_src emacs-lisp
;; (setq +org-capture-todo-file)
#+end_src
** Org-Pomodoro
#+begin_src emacs-lisp
(defun set-pomodoro-length (minutes)
  "Set the org-pomodoro-length variable to the specified value in MINUTES."
  (interactive "nEnter pomodoro length in minutes: ")
  (setq org-pomodoro-length minutes)
  (message "org-pomodoro-length set to %d minutes." minutes))

(setq org-enable-notification t)
(setq org-pomodoro-manual-break t)
(setq org-pomodoro-start-sound-p t)
(setq org-pomodoro-start-sound
      "~/.dotfiles/resources/sounds/pomodoro/achievement.wav")
(setq org-pomodoro-finished-sound-p t)
(setq org-pomodoro-finished-sound
      "~/.dotfiles/resources/sounds/pomodoro/arcade-score-interface.wav")
(setq org-pomodoro-killed-sound-p t)
(setq org-pomodoro-killed-sound
      "~/.dotfiles/resources/sounds/pomodoro/alert-bells-echo.wav")
(setq org-pomodoro-short-break-sound-p t)
(setq org-pomodoro-short-break-sound
      "~/.dotfiles/resources/sounds/pomodoro/attention-bell-ding.wav")
(setq org-pomodoro-long-break-sound-p t)
(setq org-pomodoro-long-break-sound
      "~/.dotfiles/resources/sounds/pomodoro/bell-gentle-alarm.wav")
(setq org-pomodoro-overtime-sound-p t)
(setq org-pomodoro-overtime-sound
      "~/.dotfiles/resources/sounds/pomodoro/airport.wav")
(setq org-pomodoro-ticking-sound-p t)
(setq org-pomodoro-ticking-sound
      "~/.dotfiles/resources/sounds/pomodoro/tick.wav")
#+end_src
** Structure Templates
#+begin_src emacs-lisp
(after! org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("p" . "src python"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (setq org-hide-emphasis-markers t)
  )
#+end_src
** Appearance
*** Org-superstar
#+begin_src emacs-lisp
(require 'org-superstar)
(add-hook! 'org-mode-hook #'org-superstar-mode)
(setq org-superstar-headline-bullets-list '("◉" "○" "◈" "◇"))
(setq org-ellipsis " ▼")
#+end_src
*** Hide Emphasis Marker
#+begin_src emacs-lisp
(after! org
  (setq org-ellipsis " ▼")
  )
#+end_src
*** TODO My Pretty Symbols
#+begin_src emacs-lisp
#+end_src
*** Line numbers
(add-hook! 'org-mode-hook #'display-line-numbers-mode)

