config_doom.org
** Auto-tangle Configuration Files
#+begin_src emacs-lisp
(defun efs/org-babel-tangle-config ()
  (if (or
      (string-equal (buffer-file-name)
                      (expand-file-name "~/.dotfiles/config_doom.org"))
      (string-equal (buffer-file-name)
                      (expand-file-name "~/.dotfiles/zshrc.org"))
      (string-equal (buffer-file-name)
                      (expand-file-name "~/.dotfiles/ubuntu_setup.org")))
    ;; dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src
* Org-roam
** Directory
#+begin_src emacs-lisp
(setq org-roam-directory "~/roam/")
#+end_src
** Org roam completion everywhere
#+begin_src emacs-lisp
(after! org
  (setq org-roam-completion-everywhere t))
#+end_src
** DB sync in org-roam-mode-hook
#+begin_src emacs-lisp
(add-hook! 'org-roam-mode-hook #'org-roam-db-autosync-enable)
#+end_src
** Line Numbers in Captures buffer
#+begin_src emacs-lisp

(advice-add 'org-roam-buffer-persistent-redisplay :before
            (lambda () (remove-hook 'org-mode-hook 'display-line-numbers-mode)))
(advice-add 'org-roam-buffer-persistent-redisplay :after
            (lambda () (add-hook 'org-mode-hook 'display-line-numbers-mode)))
#+end_src
** Roam Capture templates
*** Org-roam-capture-template
#+begin_src emacs-lisp
(after! org
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+date: %U\n")
           :unnarrowed t)
          ("y" "python" plain (file "~/.dotfiles/resources/templates/org-roam/PythonNoteTemplate.org")
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Python")
           :unnarrowed t)
          ("l" "programming language" plain
           "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
           :unnarrowed t)
          ("b" "book notes" plain
           "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nDate: %U\nFormat Date: %<%Y-%m-%d %H:%M>\nYear: %^{Year}\n\n* Summary\n\n%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
           :unnarrowed t
           )
          ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
           :unnarrowed t))))
#+end_src
*** Org-roam-dailies-captures-templates
#+begin_src emacs-lisp
(after! org
  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry "* %<%I:%M %p>: %?"
           :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n")))))
#+end_src
** Org Roam Hacks
*** org-roam-node-insert-immediate
#+begin_src emacs-lisp
;; Bind this to C-c n I
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
#+end_src
***
* Org-gtd
#+begin_src emacs-lisp
(setq org-gtd-update-ack "3.0.0")
(use-package! org-gtd
  :after org
  :config
  (setq org-edna-use-inheritance t)
  (setq org-gtd-directory "~/gtd")
  (setq org-gtd-engage-prefix-width 20)
  (org-edna-mode)
  (add-to-list 'org-gtd-organize-hooks 'org-set-effort)
  (add-to-list 'org-gtd-organize-hooks 'org-priority)
  (map! :leader
        (:prefix ("d" . "org-gtd")
         :desc "Capture"        "c"  #'org-gtd-capture
         :desc "Engage"         "e"  #'org-gtd-engage
         :desc "Process inbox"  "p"  #'org-gtd-process-inbox
         :desc "Show all next"  "n"  #'org-gtd-show-all-next
         :desc "Stuck projects" "s"  #'org-gtd-review-stuck-projects))
  (map! :map org-gtd-clarify-map
        :desc "Organize this item" "C-c c" #'org-gtd-organize))
#+end_src
* Evil

#+begin_src emacs-lisp
(after! evil
  (setq evil-escape-key-sequence "fd")
  (setq evil-escape-excluded-states '(normal multiedit emacs motion))
  (modify-syntax-entry ?_ "w"))

#+end_src
* Python
** Init
- ~(python +lsp +pyright +pyenv)~
* Which-key
** Delay
#+begin_src emacs-lisp
(setq which-key-idle-delay 0.01)
#+end_src
* Dired
** Icons
#+begin_src emacs-lisp
(add-hook! 'dired-mode-hook #'nerd-icons-dired-mode)
#+end_src
** Dired-omit
- Back to original value
#+begin_src emacs-lisp
(after! dired-mode
  (setq dired-omit-mode nil)
  (setq dired-omit-files "^\\.?#\\|^\\.$\\|^\\.\\.$\\|^\\..*$"))
;; (add-hook! 'dired-omit-mode-hook (add-to-list 'dired-omit-extensions '".bashrc"))
;; (add-hook! 'dired-omit-mode-hook (add-to-list 'dired-omit-extensions '".zshrc"))
;; (setq dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|^\\..+$\\|^__pycache__$\\|,")
;; (setq 'dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'")
#+end_src

* Python
** Visual line mode in inferior python mode
#+begin_src emacs-lisp
(add-hook! 'inferior-python-mode-hook #'visual-line-mode)
#+end_src
** Python-pytest
#+begin_src emacs-lisp
(after! python
  (setq python-pytest-executable "python3 -m pytest"))
#+end_src
* Keybindings
** General
*** Localleader
#+begin_src emacs-lisp
;; (setq doom-localleader-key ",")
#+end_src
*** Double SPC M-x
#+begin_src emacs-lisp
(map!
        :leader :desc "M-x" "SPC" 'execute-extended-command)
#+end_src
*** Shell-command
#+begin_src emacs-lisp
(map!
        :leader :desc "Shell-command" "!" 'shell-command)
#+end_src
*** Consult
#+begin_src emacs-lisp
(map!
        "M-y" 'consult-yank-from-kill-ring)
#+end_src
** Python
#+begin_src emacs-lisp
(map! :after python
      :map python-mode-map
      :localleader
      :prefix ("e" . "pipenv"))
#+end_src
** Harpoon
#+begin_src emacs-lisp
(map! :leader
      :prefix ("j" . "harpoon")
      "m" 'harpoon-quick-menu-hydra
      "e" 'harpoon-toggle-quick-menu
      "f" 'harpoon-toggle-file
      "a" 'harpoon-add-file
      "c" 'harpoon-clear
      "g" 'harpoon-go-to-1
      "h" 'harpoon-go-to-2
      "j" 'harpoon-go-to-3
      "k" 'harpoon-go-to-4
      "l" 'harpoon-go-to-5
      "k" 'harpoon-go-to-6
      )
#+end_src
** Dired
#+begin_src emacs-lisp
(map!   :mode dired-mode
        :leader "f j" 'dired-jump)
#+end_src
** Evil
#+begin_src emacs-lisp
#+end_src
** Org
*** Pomodoro
#+begin_src emacs-lisp
(map!   :mode org-mode
        :leader "m v p" 'set-pomodoro-length)
#+end_src
*** Org-roam
#+begin_src emacs-lisp
(map!   :mode org-mode
        :leader "n r I" 'org-roam-node-insert-immediate)
#+end_src
** Windows
#+begin_src emacs-lisp
(map!
        :leader "w /" 'evil-window-vsplit
        :leader "w -" 'evil-window-split
        :map evil-window-map "c-n" #'which-key-show-next-page-cycle)
#+end_src
** Buffers
#+begin_src emacs-lisp
(map!
 :leader :desc "buffer new window" "b w" 'switch-to-buffer-other-window
 :leader :desc "doom dashboard" "b h" '+doom-dashboard/open)
#+end_src
* pdf-tools
#+begin_src shell
sudo apt-get update
sudo apt-get upgrade
sudo apt-get pdf-tools
M-x pdf-tools-install
#+end_src
* BrowseUrl
#+begin_src emacs-lisp
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "qutebrowser")
#+end_src
* Set Sqlite program
#+begin_src elisp
(setq sql-sqlite-program "/usr/bin/sqlite3")
#+end_src
adsf_asd-asdf
* Keychain environement
#+begin_src emacs-lisp

;;; Code:

;;;###autoload
(defun keychain-refresh-environment ()
  "Set ssh-agent and gpg-agent environment variables.

Set the environment variables `SSH_AUTH_SOCK', `SSH_AGENT_PID'
and `GPG_AGENT' in Emacs' `process-environment' according to
information retrieved from files created by the keychain script."
  (interactive)
  (let* ((ssh (shell-command-to-string "keychain -q --noask --agents ssh --eval"))
         (gpg (shell-command-to-string "keychain -q --noask --agents gpg --eval")))
    (list (and ssh
               (string-match "SSH_AUTH_SOCK[=\s]\\([^\s;\n]*\\)" ssh)
               (setenv       "SSH_AUTH_SOCK" (match-string 1 ssh)))
          (and ssh
               (string-match "SSH_AGENT_PID[=\s]\\([0-9]*\\)?" ssh)
               (setenv       "SSH_AGENT_PID" (match-string 1 ssh)))
          (and gpg
               (string-match "GPG_AGENT_INFO[=\s]\\([^\s;\n]*\\)" gpg)
               (setenv       "GPG_AGENT_INFO" (match-string 1 gpg))))))

;;; _
(provide 'keychain-environment)
#+end_src
* Rust
#+begin_src emacs-lisp
(after! rust
  (setq lsp-rust-server 'rust-analyzer))
#+end_src
