.config/doom/config.el

;; (use-package ement
;;   :ensure t
;;   :custom
;;   (ement-room-images t)
;;   (ement-room-prism 'both)
;;   )

;; (ement-connect :uri-prefix "http://localhost:8009")

;; (use-package burly
;;   :ensure t)

;; Thanks alphapapa!
;; (cl-defun ap/display-buffer-in-side-window (&optional (buffer (current-buffer))
;;                                                       &key (side 'right) (slot 0))
;;   "Display BUFFER in dedicated side window.
;; With universal prefix, use left SIDE instead of right.  With two
;; universal prefixes, prompt for side and slot (which allows
;; setting up an IDE-like layout)."
;;   (interactive (list (current-buffer)
;;                      :side (pcase current-prefix-arg
;;                              ('nil 'right)
;;                              ('(0) left)
;;                              (_ (intern (completing-read "Side: " '(left right top bottom) nil t))))
;;                      :slot (pcase current-prefix-arg
;;                              ('nil 0)
;;                              ('(0) 0)
;;                              (_ (read-number "Slot: ")))))
;;   (let ((display-buffer-mark-dedicated t))
;;     (display-buffer buffer
;;                     `(display-buffer-in-side-window
;;                       (side . ,side)
;;                       (slot . ,slot)
;;                       (window-parameters
;;                        (no-delete-other-windows . t))))))
;; (setf use-default-font-for-symbols nil)
;; (set-fontset-font t 'unicode "Noto Emoji" nil 'append)

;; (defun first-graphical-frame-hook-function ()
;;   (remove-hook 'focus-in-hook #'first-graphical-frame-hook-function)
;;   (provide 'ement))
;; (add-hook 'focus-in-hook #'first-graphical-frame-hook-function)

;; (with-eval-after-load 'ement
;;   (setq svg-lib-style-default (svg-lib-style-compute-default))) ;
